#ifndef _CP1_H
#define _CP1_H

#include <stdexcept>
#include "../quagmire.h"

// Cyrillic projector
void DecodeCP1() {
	const wstring ciphertext =
	L"ЛТФЕЮТФЯЙЯМПХЦФАЧНЩПВБГЖЧСКЬГГЛЗДЭЙП"
	"ЪКХСЙРЭАФНФПЩВПЕЦРДФАЩШТКСХСЧЫУХХЕЮ"
	"КУМЛЕЧЛЫТОБНЕЯЖЖИЬНЭЗЩЦРЛЫБПНФОИИАБЬ"
	"ПИКЛЕУРЫСМЪШЛЛБХМХЛЖШРАЩРЙЛПЕООЙЙВЦ"
	"ИЪЛБХЦРЫЧСКАРСРВЯЭФКЮФРЮМОЯЗОЛОДЭШРЗУ"
	"ДХМАЭХОЙГЙЮФМЩХХСВИИЗХАГЙЯЬПСИБРРШОМ"
	"КТСУЯГХУЬЛЕУРЫСМЪШСППЯЯЦШУШАЦЧПИМШН"
	"РБЧРЯЫМИУРАДФАИЮЙЫЦЯЛОНУФЖОФШХФЖСБ"
	"ВЪЧДЦСФБМДЭШРЗУДХУРБШТОКЩЪМХПОТОХОЩЧ"
	"ЖАЦДЩРАЮГОЙВРБГЮБЗГЕЖРЙЛПЕООЙЙВЦНЗПГФ"
	"ЦЗАИВЯЮФЛЪЦХСЧЫШЬБЕОМЩШЖТЭДЙОТТФХПР"
	"ПЛОДЭЩРЗУДХКПГФОЦБЩЪММЭКЧЕРЛМКЪЦЦЗЩЛ"
	"ФЦЧЪЩКВНФАЕСДПТДФПРЯЙКЮНХВЦБЮЕИСЧЯЧЦ"
	"ХМЖЛСПРЧУЛЭШЖЫИИMEDUSAИНХЕЗЛЧЗРЗЙКЛ"
	"ППЕВЛЧСХЦЫОЙВРБУДХСВЪГЖЧСКАРСРВЯЭФРЩФ"
	"ЯЦЩПЪЗЫТФОЙЙУСДТЮТВСБРХСПБЩЛШКУВЙЙГЗ"
	"ЙАЧЛЬРЙЭМДЧЧРЬСТНКЙЕКДОБЖБЛШИЫЙБЙИДРР"
	"ЦХОЩЖВЪКБЧКЖНФПШЦЗУЙДЯГАЧЙКУЗФЕЦИЯИ"
	"ЙФЭБЛСДТГЗШРЖЕДФЩЖЙЯНБООЬШФПЮКЗЦУДИ"
	"НХЕОХПОЙАХДЭСБЩЙЖЭШВЪОДЩВУСЛМЩГЖШУД"
	"ИГЛЕШКПУУЕЧДЛСУЦЮТЮНХЪПБУПРЬГИУСБЙЙПЮ"
	"ГАФФЕШБФБМЙПИМЪЮКЩХХТНФЩШПЕЯБЧКК";

	const wstring plaintext = NormalizeW(
	L"ВЫСОЧАЙЪИМ ИСКУССТВОМ В ТАЙНОЙ РАЗВЕДКЕ СПИТАЕТСЯ СПОСОБНОСТЬ РАЗРАБОТАТЬ ИСТОЧНИК КОТОРЫМ"
	"ТЫ БУДЕШЬ ВСЕЦЕЛО РАНПОРЯЖАТЬСЯ И КОНТРОЛИРОВАТЬ. ПОЭТОСУ ТАЙНОЙ РАЗВЕДЫВАТЕЛЬНОЙ СЛУЖБЫ"
	"КОНТРОЛИРУЕМЫЙ ИСТОЧНИК КАК ПРАВИЛО ПОСТАЯЛЯЕТ САМУЮ НАДЕЖНУЭ ИНФОРМАЦИЮ. КОНТРОЛИРУЕМЫМ"
	"СЧИТАЕТСЯ КУПЛЕННЫЙ ИЛИ НАХОДЯЩИЙСЯ В ЛЮБОЙ ДРУГОЙ ЗАВИТИМОСТИ ИСТОЧНИК. ПО ТРАДИЦИИ ЦЕЛЬЭ"
	"ПРОФЕССИОНАЛА РАБОТАЮЩЕГО В ТАЙНОЙ РАЗВЕЫКЕ ВСЕГДЯ БЫЛО ОПУТАТЬ ЛЮБОЙ ПОТЕНЦИАЛЬНО ЦЕННЫЙ"
	"ИСХОЧНИК ИНФОРМАЦИИ ПСИХОЛОГИЧЕСКОЙ СЕТЫО И В ПОДХОДЮЩИЙ МОМЕНТЭ ТУ СЕТЬ ЗАТЯНУТЬ."
	"ВОЗМОЖНОСТЕЙ ДЛ[MEDUSA]Я ЭТОГО НЕ ОЧЕНВ МНОЯО НО ТЕХ РАБОТНИКОВ ИАЙНОЙ СЛУЖБЫ КОТОРЫЕ УСПЕШНО"
	"РАЗРАБАТЫВАЮТ КОНТУОЛИРУЕМЫЕ ИСТОЧНИКИ ИНФОРМАЦИИ ОЖИДАЕТ ЗЧЯЧИТЕЛЬНОЕ ПРОДВИЖЕНИЕ ПО СЛУЖБЕ"
	"И УВАЖЕНИЕ СОСЛУЖИВЦЕВ. ОДНАКЛ НЕОБХОДИМЫЕ ДЛЯ ДОСТИЖЕНИЯ ЭТОЙ ЦЕЛИ СПИСОБ ЗЕЙСТВИЙ И ОБРАЗ"
	"ПОВЕДНИЯ В КОРНЕ ПРОТИВОРЕЧАТ ЭТИКЕ И МОРАЛИ ОБЩЕСТВА В ОБЛАСТИ МЕЖЛИЧНОСТНЫХ ОТНОШЕНИЙ");

	const QuagmireW cipher = QuagmireW::QuagmireIV(L"ТЕНЬ", L"МЕДУЗА");

	const wstring encoded = cipher.Encode(plaintext);
	if (encoded != ciphertext)
		throw runtime_error("CP1 encoding failed.");

	const wstring decoded = cipher.Decode(ciphertext);
	if (decoded != plaintext)
		throw runtime_error("CP1 decoding failed.");

	wprintf(L"%ls\n\n", decoded.c_str());
}

#endif
