#ifndef _CP2_H
#define _CP2_H

#include <stdexcept>
#include "../quagmire.h"

void DecodeCP2() {
	const wstring ciphertext =
	L"ЩВЙЩЗЛЮСВЮЙКУКФСЫТЫСВЛСЛЬЗУЦИКЩДРСУРЗ"
	"ХРФЙРЭМРХФЛКФАЙЙКУАЛЩГМЙЖШЪЙЬЩКФНФ"
	"ИДЙРФГКУКАЯЙОУМАТЭТЦКВЕЖОЙИДЦДКГЩФЕЖ"
	"БЮХЛЕССЭСНЩЩХПОЬДЖЙЙЗГЕИТЙМАШЙЙУМФС"
	"ЫТЫСВСИДСДРБФНУОРУШТБЗПЪДЗЯЫААЧКУМАЯХ"
	"ТМЦРИЦЗЩЛЛЕУУПФЖТЭДУХРШЙОРБЭЦЙОПЙЛЪЙ"
	"ТЧШЙАФНПШФЭМБЩЪЖТПДЛРШБШБЧРЖЫМНЧЗЫ"
	"ТЙЖЪСМЪЧДХКЛНЦПЗХРФЙРЭМРХФМЫБВЪЧБШЕФ"
	"БЖТЩВВЪУБЧКЖАЦПЫГШАМИПРЙЪГОЦКЙГРЛЮБУ"
	"СПБЮРРХФТЫХЖТГИЙКАФМТНКЙФФНЦЙЫСЧБШЕ"
	// Antipodes:
	"ФБЖБЛСВТЧРЫЙПТМБОЙМСГУМБП"
	"ЪЦРЙРАЪХКЫХАДГОЩГДЦСТМСГЪЮБЭМЙЩГЯЛ"
	"ОЬЦЧШЮСФЕЖБЮХЛЕЙЬЩХШШГОЭШВЕХОЩЖ"
	"РЮКТПШРАЧТЛБХМЦЯСБЛЬНРГПРУТБЭШВЕСМЫ"
	"ЗФЮЙАЯЗХУФОНСВЩГМЫБВСЮБШСВЦПТЪТХСЙ"
	"РЭАФЭФЙЪФРЯЙРУФРФГРДЭЙЬФЗЩЗАТЧДЛСЖ"
	"ТУЛПЖВЪКБЧКЖТГГЙУАШЙДПДРЬЩЗЩГРШМР"
	"ПОЖЫФЕЛКПНЙРЯЫААЧКУМРФХТМЦРИЦЗЩДР"
	"ШЖДРЗПЪВНЭОЖНФЙЭОЖШФНЙРЙЪХЛШКХЪП"
	"БЭХФЬХОЩГРЖМОЯЗХВЮБЧТЧЭЖЙПЭАБЙИДХХ"
	"ФЩНЩДПВЧОПРПЪЙАПОАТГЦПЛФБШТЧТЙФНП"
	"ЮЦСЮЙКУАХФЛТБКХВРДНСФВКАПРПЛЫГЙХРФ"
	"ЙОАЗПЪЙЛЭСБЕФМЙХПЛЫЬЩХШШГОЭШВЦУКГ";

	const wstring plaintext = NormalizeW(
	L"ОБ ИЗГОТОВЛЕНИИ САХАРОВЫМ ОЧЕРЕДНОГО АНТЮСОВЕТСКОГО 'ОБРАЩЕНИЯ' К ЗАПАДУ И ЕГО ИСПОЛЬЗОВАНИИ"
	"АМЕРИКАНЦАМИ ВО ВРАЖДЕБНЫХ СОВЕТСКОМУ СОЮЗУ ЦЕЛЯХ === В МАЕ 1982 ГОДА АКАДЕМИК САХАРОВ А.Д."
	"ИЗГОТОВИЛ 'ОБРАЩЕНИБ' К 'УЧАСТНИКАМ ПАГУОШСКОЙ КОНФЕРЕНЦИИ', СОДЕРЖАЩЕЕ РЕЗКИЕ АНТИСОВЕТСКИЕ"
	"ОЦЕНКИ ВНУТРЕННЕЙ И ВНЕШНЕЙ ПОЛИТИКИ КПСС Ю СОВЕТСКОГО ПРАВИТЕЛЬСТВА, ОБВИНЕНИЕ СССР В"
	"'УСИЛЕНИИ АРМИИ, ФЛОТА, РАКЕТНОГО АРСЕНАЛА И АВИАЦИИ', 'ВО ВМЗШАТЕЛЬ"

	"СТВЕ ВО ВНТТРЗННИЕ ДЗЛА АФГАНИСТАНА И ПНР'. САХАРОВ ДЕМАГОГИЧЕСКИ ЗАЯВЛЯЕТ, ЧТО СОВЕТСКОЕ"
	"ГОСУДАРСТВО ПРОДОЛЖАЕТ ОСТАВАТЬСЯ 'ЗАКРЫТЫМ ОБЩЕСТВОМ', ПРЕСЛЕДУЕТ 'БОРЦОВ ЗА ПРАВА ЧЕЛОВЕКА'."
	"ПЫТАЕТСЯ СКОМПРОМЕТИРОВАТЬ ШИРОКОЕ АНТИВОЕННОЕ ДВИЖЕНИЕ НА ЗАПАДЕ И ЕГО РУКОВОДИТЕЛЕЙ."
	"ОБВИНПЕТ УЧАСТНИКОВ ПАГУОШСКОГО ДВИЖЕНИЯ В 'СЛЕПОМ СЛЕДОВАНИИ' ПОЛИТИКЕ СССР, ПРОВОЦИРУЕТ"
	"УЧЕНЫХ К ВМЕШАТЕЛЬСТВУ ВО ГНУТРЕННИЕ ДЕЛА НАШЕЙ СТРАНЫ И ВЫСТУПЛЕНИЯТ В ЗАЩИТУ ЛИЦ,"
	"ОСУЖДЕННЫХ ЗА СОВЕРШЕНИЕ ОСОБО ОПАСНЫХ ГОСУДАРСТВЕННЫ");

	const QuagmireW cipher = QuagmireW::QuagmireIV(L"ТЕНЬ", L"МЕДУЗА");

	const wstring encoded = cipher.Encode(plaintext);
	if (encoded != ciphertext)
		throw runtime_error("CP2 encoding failed.");

	const wstring decoded = cipher.Decode(ciphertext);
	if (decoded != plaintext)
		throw runtime_error("CP2 decoding failed.");

	wprintf(L"%ls\n\n", decoded.c_str());
}

#endif
